app/views/message/_messagelist.html.erb

    <% messages.each do |m|
        from = User.where(:id => m.from_id)[0]
---
SELECT "users".* FROM "users" WHERE ("users".message_id = 1) LIMIT 1