app/views/search/_userslist.html.erb

          affilstr = ""
          if u.affiliations.size > 0
---
SELECT * FROM `affiliations` INNER JOIN `affiliations_users` ON `affiliations`.id = `affiliations_users`.affiliation_id WHERE (`affiliations_users`.user_id = 1 )

          %>
          <span class="search_works"><p>No. of works: <%= u.works.size %></p></span>
---
SELECT * FROM `works` INNER JOIN `users_works` ON `works`.id = `users_works`.work_id WHERE (`users_works`.user_id = 1 )