app/views/user/edit_work.html.erb

        tag_str = ""
        @af.tags.each{ |t| tag_str << "#{t.name},"}
---
SELECT * FROM "tags" INNER JOIN "tags_works" ON "tags".id = "tags_works".tag_id WHERE ("tags_works".work_id = 4 )