app/views/user/edit.html.erb

    <h3>Affiliations</h3>
    <% if @user.affiliations.length < 1 %>
---
SELECT * FROM "affiliations" INNER JOIN "affiliations_users" ON "affiliations".id = "affiliations_users".affiliation_id WHERE ("affiliations_users".user_id = 1 )