app/views/user/view.html.erb

SELECT * FROM `affiliations` INNER JOIN `affiliations_users` ON `affiliations`.id = `affiliations_users`.affiliation_id WHERE (`affiliations_users`.user_id = 1 )
---
					<% end %>
					<% if @vuser.affiliations.length > 0 %>