app/controllers/message_controller.rb

  def inbox
    if session[:user]
      @user = User.where(:handle => session[:user])[0]
---
SELECT `users`.* FROM `users` WHERE (`users`.`handle` = 'carl')

  def view
    message = Message.where(:id => params[:mid])[0]
    if !message.nil?
      if !session[:user].nil?
        u = User.where(:handle => session[:user])[0]
        if message.to_id == u.id
          @message = message
          @to = u.handle
          @from = User.where(:id => message.from_id)[0].handle
          if !@message.read
            @message.read = true
            @message.save
---
SELECT `messages`.* FROM `messages` WHERE (`messages`.`id` = 1)
SELECT `users`.* FROM `users` WHERE (`users`.`handle` = 'carl')
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1)
UPDATE "messages" SET "read" = 't', "updated_at" = '2011-05-13 23:00:01.221666' WHERE ("messages"."id" = 1)

  def compose
    if session[:user]
      @user = User.where(:handle => session[:user])[0]
---
SELECT `users`.* FROM `users` WHERE (`users`.`handle` = 'test')

  def reply
    message = Message.where(:id => params[:mid])[0]
    if !message.nil?
      if !session[:user].nil?
        user = User.where(:handle => session[:user])[0]
        if message.to_id == user.id
          @user = user
          @old_message = message
          @to = User.where(:id => message.from_id)[0].handle
---
SELECT "messages".* FROM "messages" WHERE ("messages"."id" = 1)
SELECT "users".* FROM "users" WHERE ("users"."handle" = 'carl')
SELECT "users".* FROM "users" WHERE ("users"."id" = 1)

  def create_mail
    if !session[:user].nil?
      @user = User.where(:handle => session[:user])[0]
      @to = params[:to]
      @subject = params[:subject]
      @body = params[:body]

      if @to == "" or @body == "" or @subject == ""
       flash[:notice] = "Remember to fill in all the fields"
       else
         to_user = User.where(:handle => @to)[0]
         if to_user.nil?
           flash[:notice] = "Unrecognised user"
         else
           message = Message.new
           message.to_id = to_user.id
           message.from_id = @user.id
           message.subject = @subject
           message.body = @body

           message.save
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
INSERT INTO "messages" ("from_id", "to_id", "subject", "body", "read", "created_at", "updated_at") VALUES (1, 1, NULL, 'Reply

  def delete
    message = Message.where(:id => params[:mid])[0]
    if !message.nil?
      if !session[:user].nil?
        u = User.where(:handle => session[:user])[0]
        if message.to_id == u.id
          @user = u
          @message = message
          @message.destroy
---
SELECT "messages".* FROM "messages" WHERE ("messages"."id" = 3)
SELECT "users".* FROM "users" WHERE ("users"."handle" = 'carl')
DELETE FROM "messages" WHERE ("messages"."id" = 3)

  def unread
    message = Message.where(:id => params[:mid])[0]
    if !message.nil?
      if !session[:user].nil?
        u = User.where(:handle => session[:user])[0]
        if message.to_id == u.id
          @user = u
          @message = message
          @message.read = false
          @message.save
---
SELECT `messages`.* FROM `messages` WHERE (`messages`.`id` = 1)
SELECT `users`.* FROM `users` WHERE (`users`.`handle` = 'carl')
UPDATE "messages" SET "read" = 'f', "updated_at" = '2011-05-15 16:17:18.251807' WHERE ("messages"."id" = 4)