app/controllers/search_controller.rb

SELECT `users`.* FROM `users`
SELECT `works`.* FROM `works`
SELECT "users".* FROM "users" WHERE ("users"."search_str" = 'test#1.0;c%23#0.1;Faux#0.1;IR#0.1;ruby#0.25;rails#0.25;ir#0.25')
SELECT `works`.* FROM `works` WHERE (`works`.`search_str` = 'import::require#1.0;ruby#0.25;rails#0.25;ir#0.25;social#0.25;networking#0.25;carl#1.0')
SELECT `users`.* FROM `users` ORDER BY updated_at DESC LIMIT 5
SELECT `works`.* FROM `works` ORDER BY updated_at DESC LIMIT 5
---
  def search
		if !params[:search_query].nil? && params[:search_query] != ""
			@query = params[:search_query]

			keywords = @query.split(" ")
			strs = []
      wstrs = []

			u_all = User.all
			w_all = Work.all
			u_all.each { |u| strs << u.search_str}
			w_all.each { |w| wstrs << w.search_str}

			results = Search.search_and_rank(keywords, strs)
			resultsw = Search.search_and_rank(keywords, wstrs)

			@results = []
			results.each { |r| @results << User.where(:search_str => r)[0]}

			@results_w = []
			resultsw.each { |r| @results_w << Work.where(:search_str => r)[0]}

		end

		@recent_users = User.all(:order => "updated_at DESC", :limit => 5)
		@recent_works = Work.all(:order => "updated_at DESC", :limit => 5)