app/controllers/user_controller.rb

SELECT "tags".* FROM "tags" WHERE ("tags"."name" = 'java')
---
  def remove_tag
    @user = User.where(:handle => session[:user])[0]
    if params[:name] != ""
      t = Tag.where(:name => params[:name])