app/controllers/user_controller.rb

  def create
		if @validated
			u = User.new
      u.name 					= params[:name]
      u.handle 				= params[:handle]
      u.email 				= params[:email]
      u.showname 			= (params[:showname]) ? true : false;
      u.showemail 		= (params[:showemail]) ? true : false;
      u.notify 				= (params[:notify]) ? true : false;
			s = Password.salt()
      u.passhash 			= Password.hash(params[:pass1],s)
      u.salt 					= s

			suc = verify_recaptcha && u.save
---
INSERT INTO "users" ("name", "handle", "email", "showname", "showemail", "notify", "passhash", "created_at", "updated_at", "salt") VALUES ('Carl Ellis', 'carl', 'carlc75@gmail.com', 't', 't', 't', '3d87c4a21e7af51bf151fc2cd15db26d7751d81464cc8987b9d298d3fe84f114b962678d057d0d3e8c87475ece53d24b10f0d14a8bd1f1780188b37f860d9b88', '2011-01-06 20:49:10.166860', '2011-01-06 20:49:10.166860', 'aUjNaUUO2vtYffXoT5ALtBeTUCiPS9a5SZSBmGtVmfzUu5UOnWxluXwVrA3pzLRpS')

  def edit
    if session[:user]
      if session[:user] == params[:handle]
        @user = User.where(:handle => session[:user])[0]
        if @validated
          u = @user
          u.name 					= params[:name]
          u.email 				= params[:email]
          u.showname 			= (params[:showname]) ? true : false;
          u.showemail 		= (params[:showemail]) ? true : false;
          u.notify 				= (params[:notify]) ? true : false;
          u.save
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
UPDATE "users" SET "showname" = 'f', "updated_at" = '2011-01-15 15:32:51.210388' WHERE ("users"."id" = 1)

  def view
		if(session[:user] && !params[:handle])
			@vuser = User.where(:handle => session[:user])[0]
---
SELECT `users`.* FROM `users` WHERE (`users`.`handle` = 'carl')

  def create_affil
    @user = User.where(:handle => session[:user])[0]
    if params[:affiliation] != ""
      # See if already exists, if so, use it
      af = Affiliation.where(:name => params[:affiliation])
      if af.length == 0
        af = Affiliation.new
        af.name = params[:affiliation]
        af.save
      else
        af = af[0]
      end

      # Add to user
      @user.affiliations << af if !@user.affiliations.include?(af)
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "affiliations".* FROM "affiliations" WHERE ("affiliations"."name" = 'LUCS')
INSERT INTO "affiliations" ("name", "created_at", "updated_at") VALUES ('LUCS', '2011-01-16 17:20:27.158506', '2011-01-16 17:20:27.158506')
SELECT * FROM "affiliations" INNER JOIN "affiliations_users" ON "affiliations".id = "affiliations_users".affiliation_id WHERE ("affiliations_users".user_id = 1 )

  def remove_affil
    @user = User.where(:handle => session[:user])[0]
    if params[:name] != ""
      af = Affiliation.where(:name => params[:name])
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "affiliations".* FROM "affiliations" WHERE ("affiliations"."name" = 'CSLU')

  def works
    if session[:user]
      if session[:user] == params[:handle]
        @user = User.where(:handle => session[:user])[0]
				validated = validate_work_params()
        if @validated
          w = Work.new
          w.name 					= params[:name]
          w.description 	= params[:description]
          w.url 					= params[:url]
          w.save
          if params[:tags] != ""
            tags = []
            params[:tags].split(",").each do |tt|
              if tt != ""
                # See if already exists, if so, use it
                t = Tag.where(:name => tt)
                if t.length == 0
                  t = Tag.new
                  t.name = tt
                  t.save
                else
                  t = t[0]
                end
                tags << t
              end
            end

            # Add to work
            tags.each do |t|
              w.tags << t if !w.tags.include?(t)
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
INSERT INTO "works" ("name", "description", "url", "created_at", "updated_at") VALUES ('Jimhi', 'Personal Website', 'http://www.jimhi.com', '2011-01-25 23:00:46.129798', '2011-01-25 23:00:46.129798')
SELECT * FROM "tags" INNER JOIN "tags_works" ON "tags".id = "tags_works".tag_id WHERE ("tags_works".work_id = 4 )
SELECT * FROM "works" INNER JOIN "users_works" ON "works".id = "users_works".work_id WHERE ("users_works".user_id = 1 )

  def remove_work
    @user = User.where(:handle => session[:user])[0]
    if params[:wid] != ""
      af = Work.where(:id => params[:wid])
      if af.length > 0
        af = af[0]
        @user.works.delete(af) if @user.works.include?(af)
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "works".* FROM "works" WHERE ("works"."id" = 1)
SELECT * FROM "works" INNER JOIN "users_works" ON "works".id = "users_works".work_id WHERE ("users_works".user_id = 1 )

  def edit_work
    @user = User.where(:handle => session[:user])[0]
    @af = nil
    if params[:wid] != ""
      @af = Work.where(:id => params[:wid])
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "works".* FROM "works" WHERE ("works"."id" = 3)


            # Add to work
            w.tags = []
            tags.each do |t|
---
SELECT * FROM "tags" INNER JOIN "tags_works" ON "tags".id = "tags_works".tag_id WHERE ("tags_works".work_id = 4 )

  def edit_tags
    @user = User.where(:handle => session[:user])[0]
---
SELECT "users".* FROM "users" WHERE ("users"."handle" = 'carl')

  def create_tag
    @user = User.where(:handle => session[:user])[0]
    if params[:tag] != ""
      tags = []
      params[:tag].split(",").each do |tt|
        if tt.strip != ""
          # See if already exists, if so, use it
          t = Tag.where(:name => tt)
          if t.length == 0
            t = Tag.new
            t.name = URI.escape(tt)
            t.save
          else
            t = t[0]
          end
          tags << t
        end
      end

      # Add to user
      tags.each do |t|
        @user.tags << t if !@user.tags.include?(t)
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "tags".* FROM "tags" WHERE ("tags"."name" = 'java')
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ('.net', '2011-05-22 11:16:08.321918', '2011-05-22 11:16:08.321918')
INSERT INTO "tags_users" ("tag_id", "user_id") VALUES (3, 1)
SELECT * FROM "tags" INNER JOIN "tags_works" ON "tags".id = "tags_works".tag_id WHERE ("tags_works".work_id = 4 )

  def remove_tag
    @user = User.where(:handle => session[:user])[0]
    if params[:id] != ""
      t = Tag.where(:id => params[:id])
      if t.length > 0
        t = t[0]
        @user.tags.delete(t) if @user.tags.include?(t)
---
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "tags".* FROM "tags" WHERE ("tags"."id" = 20)
DELETE FROM "tags_users" WHERE "tags_users"."user_id" = 1 AND "tags_users"."tag_id" IN (3)
SELECT * FROM "tags" INNER JOIN "tags_works" ON "tags".id = "tags_works".tag_id WHERE ("tags_works".work_id = 4 )

	def rate_work

		work = Work.where(:id => params[:wid])[0]
    @user = User.where(:handle => session[:user])[0]
    @vuser = work.users[0]
		rating = params[:rating]
		r = Rating.where(:work_id => params[:wid], :user_id => @user.id)

		# See if has a current rating
		if r.length == 0
			r = Rating.new
		else
			r = r[0]
		end

		# Get weight
		weight = Rate::calculate_weight(@user, work)

		#r.work_id = work.id
		#r.user_id = @user.id
		r.weight = weight
		r.score = rating

		work.ratings << r
		@user.ratings << r

		work.save
---
SELECT "works".* FROM "works" WHERE ("works"."id" = 13)
SELECT "users"."id" FROM "users" WHERE ("users"."handle" = 'carl') AND ("users".id <> 1) LIMIT 1
SELECT "ratings".* FROM "ratings" WHERE ("ratings"."work_id" = 13) AND ("ratings"."user_id" = 1)
SELECT "users".* FROM "users" INNER JOIN "users_works" ON "users".id = "users_works".user_id WHERE ("users_works".work_id = 13 ) AND ("users"."handle" = 'carl')
INSERT INTO "ratings" ("work_id", "user_id", "weight", "score", "created_at", "updated_at") VALUES (7, NULL, 0.3333333333333333, 3, '2011-11-19 18:57:01.332747', '2011-11-19 18:57:01.332747')
UPDATE "ratings" SET "weight" = 0.6666666666666667, "score" = 4, "updated_at" = '2011-05-14 20:27:41.331279' WHERE ("ratings"."id" = 5)
UPDATE "works" SET "rating" = 4.0, "updated_at" = '2011-05-14 20:27:41.563997' WHERE ("works"."id" = 13)