app/controllers/welcome_controller.rb

	def login

		# Check fields are filled
		if(params[:handle] != "" and params[:pass] != "")
			handle = params[:handle];
			pass = params[:pass][0];

			#retrieve and compare
			temp = User.where(:handle => handle)
---
SELECT `users`.* FROM `users` WHERE (`users`.`handle` = 'carl')